---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.CutFailures.CannotCutJoinedElement
source: html/5b7b6a05-44d9-5552-0ee2-5df84232fa13.htm
---
# Autodesk.Revit.DB.BuiltInFailures.CutFailures.CannotCutJoinedElement Property

Can't cut joined element.

## Syntax (C#)
```csharp
public static FailureDefinitionId CannotCutJoinedElement { get; }
```